#include <stdlib.h>
#include "dictionary.h"

const char *ndgr1[] = {
    "Например", "Всъщност", "Според мен", "Наистина", "Следователно", "Действително",
    "Реално", "Практически", "Така", "Може би", "Значи", "Вероятно", "Очевидно", "Навярно",
    "По всяка вероятност", "В действителност", "В края на краищата", NULL};

const char *ndgr2[] = {
    "Както казват", "Казват", "Напротив", "Разбира се", "Изглежда", "Струва ми се", "Види се", "Общо взето",
    "Тъй да се каже", "Между нас казано", "Първо", "Второ", "Трето", "Естествено", NULL};

const char *ndgr3[] = {
    "както казват", "казват", "напротив", "разбира се", "изглежда", "струва ми се", "види се", "общо взето",
    "тъй да се каже", "между нас казано", NULL};

const char *ndgr4[] = {
    "а", "но", "че", "и", "не", "или", NULL};

const char *ndgr5[] = {
    "дори", "само", "именно", "едва", "особено", "поне", "тъкмо", "под", "много", "малко", "даже", "чак",
    "щом", "тъй", "след", "освен", "чак", "единствено", NULL};

const char *ndgr6[] = {
    "който", "която", "което", "които", "чийто", "чиято", "чието", "чиито", NULL};

const char *ndgr7[] = {
    "за", "в", "с", "заради", "от", "по", "поради", "вследствие на", "благодарение на", NULL};

const char *ndgr8[] = {
    "а", "ала", "но", "макар и", "ако и", "та", "ама", "пък", "що", "дето", "обаче", "ами", "защото",
    "отколкото", "без да", "докато", "като", NULL};

const char *ndgr9[] = {
    "само", "дори", "едва", "чак", "даже", "единствено", "именно", "тъкмо", "много", "малко", "не", "и", NULL};

const char *ndgr10[] = {
    "за да", "без да", "като да", "освен да", "въпреки че", "освен че", "само че", "тъй че", "така че",
    "макар че", "сякаш че", "затова че", "задето", "освен дето", "освен като", "след като", "макар да",
    "ако и да", "когато", "ако", "дето", "и", "или", "че", "да", NULL};

const char *ndgr11[] = {
    "макар", "въпреки", "така", "само", "при положение", "в случай", "по причина", "при условие",
    "при все", "сякаш", "освен", "независимо", "Въпреки", "Така", "Само", "При положение че",
    "Макар", "В случай", "При условие", "При все", "Освен", "Независимо", NULL};

const char *ndgr12[] = {
    "щом", "тъй", "след", "освен", NULL};

const char *ndgr13[] = {
    "както следва", "вместо да", "за разлика от", NULL};

const char *ndgr14[] = {
    "а", "но", "че", NULL};

const char *ndgr_sorry[] = {
    "за съжаление", NULL};

const char *ndgr_ne[] = {
    "не", NULL};

const char *ndgr_zashtoto[] = {
    "защото", NULL};

const char *ndgr_che[] = {
    "че", NULL};

const char *ndgr_kato[] = {
    "като", NULL};

const char *ndgr_estestveno[] = {
    "естествено", NULL};

const char *ndgr_za_da[] = {
    "за да", NULL};

const char *ndgr_v_s[] = {
    "в", "с", NULL};
